In [7]:
import pandas as pd
import numpy as np

In [8]:
dict = {"Name":["Ganesh","Nikhil","Neha","Poonam","Neeraj","Manish","Abhinav","Vishakha","Pratik"],
        "Salary":[40000,35000,30000,50000,25000,39000,41000,55000,42000],
        "Country":["India","USA","UK","India","UK","SL","USA","India","India"]}

In [9]:
df=pd.DataFrame(dict)
df

       Name  Salary Country
0    Ganesh   40000   India
1    Nikhil   35000     USA
2      Neha   30000      UK
3    Poonam   50000   India
4    Neeraj   25000      UK
5    Manish   39000      SL
6   Abhinav   41000     USA
7  Vishakha   55000   India
8    Pratik   42000   India

In [4]:
dict=df.to_csv("salary.csv",index=False)

In [5]:
df=pd.read_csv("salary.csv")
df

        Name  Salary Country
0   Siddhesh   40000   India
1     Jayesh   35000     USA
2  Abhishekh   30000      UK
3      Suman   50000   India
4      Omkar   25000      UK
5     Manish   39000      SL
6      abdul   41000     USA
7  Bhagyavan   55000   India
8     Pratik   42000   India

In [6]:
avg=df["Salary"].mean()
avg

39666.666666666664

In [7]:
median=df.Salary.median()
median

40000.0

In [8]:
mode=df.Salary.mode()
mode

0    25000
1    30000
2    35000
3    39000
4    40000
5    41000
6    42000
7    50000
8    55000
Name: Salary, dtype: int64

In [9]:
countrywise_sum=df.groupby(["Country"])["Salary"].sum()
countrywise_sum

Country
India    187000
SL        39000
UK        55000
USA       76000
Name: Salary, dtype: int64

In [10]:
countrywise_count=df.groupby(["Country"]).count()
countrywise_count

         Name  Salary
Country
India       4       4
SL          1       1
UK          2       2
USA         2       2

In [11]:
#variance of salaries
var=df["Salary"].var()
var

85000000.0

In [12]:
#standard deviation
std=df["Salary"].std()
std

9219.544457292888

In [13]:
#skewness
skew=df.skew(axis=0, skipna=True)
skew

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_14632\2265132311.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  skew=df.skew(axis=0, skipna=True)

Salary    0.115529
dtype: float64

In [14]:
#above the skewness is positive so "X" will have right side tail

Covariance and Corelation

In [15]:
df=pd.read_csv("Datasets/BirthWeight.csv")
df.head()

   Infant ID  Gestational Age (Weeks)  Birth Weight (Grams)
0          1                     34.7                  1895
1          2                     36.0                  2030
2          3                     29.3                  1440
3          4                     40.1                  2835
4          5                     35.7                  3090

In [16]:
df.set_index("Infant ID",inplace=True)
df

           Gestational Age (Weeks)  Birth Weight (Grams)
Infant ID
1                             34.7                  1895
2                             36.0                  2030
3                             29.3                  1440
4                             40.1                  2835
5                             35.7                  3090
6                             42.4                  3827
7                             40.3                  3260
8                             37.3                  2690
9                             40.9                  3285
10                            38.3                  2920
11                            38.5                  3430
12                            41.4                  3657
13                            39.7                  3685
14                            39.7                  3345
15                            41.1                  3260
16                            38.0                  2680
17                            38.7                  2005

In [17]:
df.cov()

                         Gestational Age (Weeks)  Birth Weight (Grams)
Gestational Age (Weeks)                 9.963824              1798.025
Birth Weight (Grams)                 1798.025000            485478.750

In [18]:
df.corr(method="pearson")

                         Gestational Age (Weeks)  Birth Weight (Grams)
Gestational Age (Weeks)                 1.000000              0.817519
Birth Weight (Grams)                    0.817519              1.000000

In [19]:
#Covariance indicates that there is correlation exists between two
#Correlation coeffiecient of 0.818 indicated the relationshiup between two is positive and strong

Descriptive statistics

In [20]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from scipy.stats import skew
from scipy.stats import kurtosis

In [21]:
pd.set_option("display.max_columns",None)
pd.options.display.float_format="{:,.2f}".format

In [22]:
data=pd.read_csv("Datasets/diamonds.csv")
data

,id,carat,cut,color,clarity,depth,table,price,x,y,z
0,1,0.23,Ideal,E,SI2,61.50,55.00,326,3.95,3.98,2.43
1,2,0.21,Premium,E,SI1,59.80,61.00,326,3.89,3.84,2.31
2,3,0.23,Good,E,VS1,56.90,65.00,327,4.05,4.07,2.31
3,4,0.29,Premium,I,VS2,62.40,58.00,334,4.20,4.23,2.63
4,5,0.31,Good,J,SI2,63.30,58.00,335,4.34,4.35,2.75
...,...,...,...,...,...,...,...,...,...,...,...
53935,53936,0.72,Ideal,D,SI1,60.80,57.00,2757,5.75,5.76,3.50
53936,53937,0.72,Good,D,SI1,63.10,55.00,2757,5.69,5.75,3.61
53937,53938,0.70,Very Good,D,SI1,62.80,60.00,2757,5.66,5.68,3.56
53938,53939,0.86,Premium,H,SI2,61.00,58.00,2757,6.15,6.12,3.74
53939,53940,0.75,Ideal,D,SI2,62.20,55.00,2757,5.83,5.87,3.64

In [23]:
des_df=data.drop(['id'],axis=1)#drop id column
for col in des_df:
    if des_df[col].dtype == 'object':
        des_df=des_df.drop([col],axis=1)  #Drops all alpha-numeric columns
        
des_r=des_df.describe() #describe() gives us mean, median, mode, etc...
des_r = des_r.rename(index={'50%':'median/50%'})
des_r

,carat,depth,table,price,x,y,z
count,"53,940.00","53,940.00","53,940.00","53,940.00","53,940.00","53,940.00","53,940.00"
mean,0.80,61.75,57.46,"3,932.80",5.73,5.73,3.54
std,0.47,1.43,2.23,"3,989.44",1.12,1.14,0.71
min,0.20,43.00,43.00,326.00,0.00,0.00,0.00
25%,0.40,61.00,56.00,950.00,4.71,4.72,2.91
median/50%,0.70,61.80,57.00,"2,401.00",5.70,5.71,3.53
75%,1.04,62.50,59.00,"5,324.25",6.54,6.54,4.04
max,5.01,79.00,95.00,"18,823.00",10.74,58.90,31.80

In [24]:
#Only see won't come in exams
#Reference
var_r = des_df.var()

varlist = []
for col in des_df.columns:
    if des_df[col].dtype == 'object':
        continue
    varlist.append(round(des_df[col],5))
    
df = pd.DataFrame([varlist], columns = des_r.columns, index = ['var'])
mct = des_r.append(df)
mct

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_14632\1801795850.py:12: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mct = des_r.append(df)

,carat,depth,table,price,x,y,z
count,"53,940.00","53,940.00","53,940.00","53,940.00","53,940.00","53,940.00","53,940.00"
mean,0.80,61.75,57.46,"3,932.80",5.73,5.73,3.54
std,0.47,1.43,2.23,"3,989.44",1.12,1.14,0.71
min,0.20,43.00,43.00,326.00,0.00,0.00,0.00
25%,0.40,61.00,56.00,950.00,4.71,4.72,2.91
median/50%,0.70,61.80,57.00,"2,401.00",5.70,5.71,3.53
75%,1.04,62.50,59.00,"5,324.25",6.54,6.54,4.04
max,5.01,79.00,95.00,"18,823.00",10.74,58.90,31.80
var,0 0.23 1 0.21 2 0.23 3 ...,0 61.50 1 59.80 2 56.90 3 ...,0 55.00 1 61.00 2 65.00 3 ...,0 326 1 326 2 327 3 ...,0 3.95 1 3.89 2 4.05 3 ...,0 3.98 1 3.84 2 4.07 3 ...,0 2.43 1 2.31 2 2.31 3 ...